## Plan for org_account/aft
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 32 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                                     NAME                                                                      |
|----------|-----------------------------------------------------------------------------------------------------------------------------------------------|
| add      | `module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_policy.primary-backend-bucket`                                         |
|          | `module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_policy.secondary-backend-bucket[0]`                                    |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_s3_bucket_policy.aft_codepipeline_customizations_bucket`                  |
| update   | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm`                     |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role`                              |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata`                         |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.tag_account`                              |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_dynamodb_table.aft_controltower_events`                        |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_dynamodb_table.aft_request`                                    |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_dynamodb_table.aft_request_audit`                              |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_dynamodb_table.aft_request_metadata`                           |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_action_trigger`            |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_audit_trigger`             |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_processor`                 |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_cleanup_resources`                         |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_controltower_event_logger`                 |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_invoke_aft_account_provisioning_framework` |
|          | `module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket.secondary-backend-bucket[0]`                                           |
|          | `module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_policy.aft_access_logs_primary_backend_bucket`                         |
|          | `module.account_factory_for_terraform.module.aft_code_repositories.aws_codebuild_project.account_provisioning_customizations_pipeline`        |
|          | `module.account_factory_for_terraform.module.aft_code_repositories.aws_codebuild_project.account_request`                                     |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_codebuild_project.aft_account_customizations_terraform`                   |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_codebuild_project.aft_create_pipeline`                                    |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_codebuild_project.aft_global_customizations_terraform`                    |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_iam_role_policy.aft_identify_targets_lambda`                              |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_execute_pipeline`                      |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_get_pipeline_executions`               |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_identify_targets`                      |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_iam_role_policy.aft_enable_cloudtrail`                                   |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_delete_default_vpc`                                  |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_enable_cloudtrail`                                   |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_enroll_support`                                      |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_s3_bucket_policy.aft_access_logs`                                        |
|          | `module.account_factory_for_terraform.module.aft_ssm_parameters.aws_ssm_parameter.aft_framework_repo_git_ref`                                 |
|          | `module.account_factory_for_terraform.module.aft_ssm_parameters.aws_ssm_parameter.aft_version`                                                |
| recreate | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_lambda_layer_version.layer_version`                                         |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-aws-lz/actions/runs/18177711558).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm will be updated in-place
  ~ resource "aws_lambda_function" "account_metadata_ssm" {
        id                             = "aft-account-provisioning-framework-account-metadata-ssm"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-14-1:1",
        ] -> (known after apply)
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role will be updated in-place
  ~ resource "aws_lambda_function" "create_role" {
        id                             = "aft-account-provisioning-framework-create-aft-execution-role"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-14-1:1",
        ] -> (known after apply)
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata will be updated in-place
  ~ resource "aws_lambda_function" "persist_metadata" {
        id                             = "aft-account-provisioning-framework-persist-metadata"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-14-1:1",
        ] -> (known after apply)
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.tag_account will be updated in-place
  ~ resource "aws_lambda_function" "tag_account" {
        id                             = "aft-account-provisioning-framework-tag-account"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-14-1:1",
        ] -> (known after apply)
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_dynamodb_table.aft_controltower_events will be updated in-place
  ~ resource "aws_dynamodb_table" "aft_controltower_events" {
      ~ billing_mode                = "PROVISIONED" -> "PAY_PER_REQUEST"
        id                          = "aft-controltower-events"
        name                        = "aft-controltower-events"
        tags                        = {}
        # (12 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_dynamodb_table.aft_request will be updated in-place
  ~ resource "aws_dynamodb_table" "aft_request" {
      ~ billing_mode                = "PROVISIONED" -> "PAY_PER_REQUEST"
        id                          = "aft-request"
        name                        = "aft-request"
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_dynamodb_table.aft_request_audit will be updated in-place
  ~ resource "aws_dynamodb_table" "aft_request_audit" {
      ~ billing_mode                = "PROVISIONED" -> "PAY_PER_REQUEST"
        id                          = "aft-request-audit"
        name                        = "aft-request-audit"
        tags                        = {}
        # (12 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_dynamodb_table.aft_request_metadata will be updated in-place
  ~ resource "aws_dynamodb_table" "aft_request_metadata" {
      ~ billing_mode                = "PROVISIONED" -> "PAY_PER_REQUEST"
        id                          = "aft-request-metadata"
        name                        = "aft-request-metadata"
        tags                        = {}
        # (8 unchanged attributes hidden)

      - global_secondary_index {
          - hash_key           = "email" -> null
          - name               = "emailIndex" -> null
          - non_key_attributes = [
              - "id",
            ] -> null
          - projection_type    = "INCLUDE" -> null
          - read_capacity      = 1 -> null
          - write_capacity     = 1 -> null
        }
      - global_secondary_index {
          - hash_key           = "type" -> null
          - name               = "typeIndex" -> null
          - non_key_attributes = [] -> null
          - projection_type    = "ALL" -> null
          - read_capacity      = 1 -> null
          - write_capacity     = 1 -> null
        }
      + global_secondary_index {
          + hash_key           = "email"
          + name               = "emailIndex"
          + non_key_attributes = [
              + "id",
            ]
          + projection_type    = "INCLUDE"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }
      + global_secondary_index {
          + hash_key           = "type"
          + name               = "typeIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }

        # (6 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_action_trigger will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_action_trigger" {
        id                             = "aft-account-request-action-trigger"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-14-1:1",
        ] -> (known after apply)
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_audit_trigger will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_audit_trigger" {
        id                             = "aft-account-request-audit-trigger"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-14-1:1",
        ] -> (known after apply)
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_processor will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_processor" {
        id                             = "aft-account-request-processor"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-14-1:1",
        ] -> (known after apply)
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_cleanup_resources will be updated in-place
  ~ resource "aws_lambda_function" "aft_cleanup_resources" {
        id                             = "aft-cleanup-resources"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-14-1:1",
        ] -> (known after apply)
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_controltower_event_logger will be updated in-place
  ~ resource "aws_lambda_function" "aft_controltower_event_logger" {
        id                             = "aft-controltower-event-logger"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-14-1:1",
        ] -> (known after apply)
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_invoke_aft_account_provisioning_framework will be updated in-place
  ~ resource "aws_lambda_function" "aft_invoke_aft_account_provisioning_framework" {
        id                             = "aft-invoke-aft-account-provisioning-framework"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-14-1:1",
        ] -> (known after apply)
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket.secondary-backend-bucket[0] will be updated in-place
  ~ resource "aws_s3_bucket" "secondary-backend-bucket" {
        id                          = "aft-backend-137554749751-secondary-region"
      ~ tags                        = {
          - "Data classification" = "Unclassified" -> null
            "Name"                = "aft-backend-137554749751-secondary-region"
        }
      ~ tags_all                    = {
          - "Data classification" = "Unclassified" -> null
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_policy.aft_access_logs_primary_backend_bucket will be updated in-place
  ~ resource "aws_s3_bucket_policy" "aft_access_logs_primary_backend_bucket" {
        id     = "aft-backend-137554749751-primary-region-access-logs"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "s3:PutObject"
                        Condition = {
                            ArnLike      = {
                                "aws:SourceArn" = "arn:aws:s3:::aft-backend-137554749751-primary-region"
                            }
                            StringEquals = {
                                "aws:SourceAccount" = "137554749751"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            Service = [
                                "logging.s3.amazonaws.com",
                            ]
                        }
                        Resource  = [
                            "arn:aws:s3:::aft-backend-137554749751-primary-region-access-logs/*",
                        ]
                        Sid       = "Allow PutObject"
                    },
                  + {
                      + Action    = "s3:*"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = [
                          + "arn:aws:s3:::aft-backend-137554749751-primary-region-access-logs",
                          + "arn:aws:s3:::aft-backend-137554749751-primary-region-access-logs/*",
                        ]
                      + Sid       = "AllowSSLRequestsOnly"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_policy.primary-backend-bucket will be created
  + resource "aws_s3_bucket_policy" "primary-backend-bucket" {
      + bucket = "aft-backend-137554749751-primary-region"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:*"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = [
                          + "arn:aws:s3:::aft-backend-137554749751-primary-region",
                          + "arn:aws:s3:::aft-backend-137554749751-primary-region/*",
                        ]
                      + Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_policy.secondary-backend-bucket[0] will be created
  + resource "aws_s3_bucket_policy" "secondary-backend-bucket" {
      + bucket = "aft-backend-137554749751-secondary-region"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:*"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = [
                          + "arn:aws:s3:::aft-backend-137554749751-secondary-region",
                          + "arn:aws:s3:::aft-backend-137554749751-secondary-region/*",
                        ]
                      + Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.account_factory_for_terraform.module.aft_code_repositories.aws_codebuild_project.account_provisioning_customizations_pipeline will be updated in-place
  ~ resource "aws_codebuild_project" "account_provisioning_customizations_pipeline" {
        id                     = "arn:aws:codebuild:ca-central-1:137554749751:project/ct-aft-account-provisioning-customizations"
        name                   = "ct-aft-account-provisioning-customizations"
        tags                   = {}
        # (10 unchanged attributes hidden)

      ~ source {
          ~ buildspec           = <<-EOT
                # Copyright Amazon.com, Inc. or its affiliates. All rights reserved.
                # SPDX-License-Identifier: Apache-2.0
                #
                version: 0.2
                
                phases:
                  pre_build:
                    commands:
                      - DEFAULT_PATH=$(pwd)
                      - TIMESTAMP=$(date '+%Y-%m-%d %H:%M:%S')
                      - AWS_MODULE_SOURCE=$(aws ssm get-parameter --name "/aft/config/aft-pipeline-code-source/repo-url" --query "Parameter.Value" --output text)
                      - AWS_MODULE_GIT_REF=$(aws ssm get-parameter --name "/aft/config/aft-pipeline-code-source/repo-git-ref" --query "Parameter.Value" --output text)
                      - TF_VERSION=$(aws ssm get-parameter --name "/aft/config/terraform/version" --query "Parameter.Value" --output text)
                      - TF_DISTRIBUTION=$(aws ssm get-parameter --name "/aft/config/terraform/distribution" --query "Parameter.Value" --output text)
                      - CT_MGMT_REGION=$(aws ssm get-parameter --name "/aft/config/ct-management-region" --query "Parameter.Value" --output text)
                      - AFT_MGMT_ACCOUNT=$(aws sts get-caller-identity --query Account --output text)
                      - AFT_EXEC_ROLE_ARN=arn:$AWS_PARTITION:iam::$AFT_MGMT_ACCOUNT:role/AWSAFTExecution
                      - AFT_ADMIN_ROLE_NAME=$(aws ssm get-parameter --name /aft/resources/iam/aft-administrator-role-name | jq --raw-output ".Parameter.Value")
                      - AFT_ADMIN_ROLE_ARN=arn:$AWS_PARTITION:iam::$AFT_MGMT_ACCOUNT:role/$AFT_ADMIN_ROLE_NAME
                      - ROLE_SESSION_NAME=$(aws ssm get-parameter --name /aft/resources/iam/aft-session-name | jq --raw-output ".Parameter.Value")
                      - |
                        ssh_key_parameter=$(aws ssm get-parameter --name /aft/config/aft-ssh-key --with-decryption 2> /dev/null || echo "None")
                        if [[ $ssh_key_parameter != "None" ]]; then
                          ssh_key=$(jq --raw-output ".Parameter.Value" <<< $ssh_key_parameter)
                          mkdir -p ~/.ssh
                          echo "Host *" >> ~/.ssh/config
                          echo "StrictHostKeyChecking no" >> ~/.ssh/config
                          echo "UserKnownHostsFile=/dev/null" >> ~/.ssh/config
                          echo "$ssh_key" > ~/.ssh/ssh_key
                          echo -e "\n\n" >>  ~/.ssh/ssh_key
                          chmod 600 ~/.ssh/ssh_key
                          eval "$(ssh-agent -s)"
                          ssh-add ~/.ssh/ssh_key
                        fi
                      - git config --global credential.helper '!aws codecommit credential-helper $@'
                      - git config --global credential.UseHttpPath true
                      - git clone -b $AWS_MODULE_GIT_REF $AWS_MODULE_SOURCE aws-aft-core-framework
                      - python3 -m venv ./venv
                      - source ./venv/bin/activate
                      - pip install jinja2-cli==0.7.0 Jinja2==3.0.1 MarkupSafe==2.0.1 boto3==1.18.56 requests==2.26.0
                      - |
                        if [ $TF_DISTRIBUTION = "oss" ]; then
                          TF_BACKEND_REGION=$(aws ssm get-parameter --name "/aft/config/oss-backend/primary-region" --query "Parameter.Value" --output text)
                          TF_KMS_KEY_ID=$(aws ssm get-parameter --name "/aft/config/oss-backend/kms-key-id" --query "Parameter.Value" --output text)
                          TF_DDB_TABLE=$(aws ssm get-parameter --name "/aft/config/oss-backend/table-id" --query "Parameter.Value" --output text)
                          TF_S3_BUCKET=$(aws ssm get-parameter --name "/aft/config/oss-backend/bucket-id" --query "Parameter.Value" --output text)
                          TF_S3_KEY=account-provisioning-customizations/terraform.tfstate
                          cd /tmp
                          echo "Installing Terraform"
                          curl -o terraform_${TF_VERSION}_linux_amd64.zip https://releases.hashicorp.com/terraform/${TF_VERSION}/terraform_${TF_VERSION}_linux_amd64.zip
                          unzip -o terraform_${TF_VERSION}_linux_amd64.zip && mv terraform /usr/bin
                          terraform -no-color --version
                          cd $DEFAULT_PATH/terraform
              -           for f in *.jinja; do jinja2 $f -D timestamp="$TIMESTAMP" -D tf_distribution_type=$TF_DISTRIBUTION -D region=$TF_BACKEND_REGION -D provider_region=$CT_MGMT_REGION -D bucket=$TF_S3_BUCKET -D key=$TF_S3_KEY -D dynamodb_table=$TF_DDB_TABLE -D kms_key_id=$TF_KMS_KEY_ID -D aft_admin_role_arn=$AFT_EXEC_ROLE_ARN -D tf_version=$TF_VERSION >> ./$(basename $f .jinja).tf; done
              +           if ls *.jinja >/dev/null 2>&1; then
              +             for f in *.jinja; do
              +               jinja2 "$f" -D timestamp="$TIMESTAMP" -D tf_distribution_type=$TF_DISTRIBUTION \
              +                 -D region="$TF_BACKEND_REGION" -D provider_region="$CT_MGMT_REGION" -D bucket="$TF_S3_BUCKET" \
              +                 -D key="$TF_S3_KEY" -D dynamodb_table="$TF_DDB_TABLE" -D kms_key_id="$TF_KMS_KEY_ID" \
              +                 -D aft_admin_role_arn="$AFT_EXEC_ROLE_ARN" -D tf_version="$TF_VERSION" >> "./$(basename "$f" .jinja).tf"
              +             done
              +           else
              +             echo "No Jinja2 templates found - skipping template processing"
              +           fi
                          for f in *.tf; do echo "\n \n"; echo $f; cat $f; done
                          JSON=$(aws sts assume-role --role-arn ${AFT_ADMIN_ROLE_ARN} --role-session-name ${ROLE_SESSION_NAME})
                          #Make newly assumed role default session
                          export AWS_ACCESS_KEY_ID=$(echo ${JSON} | jq --raw-output ".Credentials[\"AccessKeyId\"]")
                          export AWS_SECRET_ACCESS_KEY=$(echo ${JSON} | jq --raw-output ".Credentials[\"SecretAccessKey\"]")
                          export AWS_SESSION_TOKEN=$(echo ${JSON} | jq --raw-output ".Credentials[\"SessionToken\"]")
                          terraform init -no-color
                        else
                          TF_BACKEND_REGION=$(aws ssm get-parameter --name "/aft/config/oss-backend/primary-region" --query "Parameter.Value" --output text)
                          TF_ORG_NAME=$(aws ssm get-parameter --name "/aft/config/terraform/org-name" --query "Parameter.Value" --output text)
                          TF_TOKEN=$(aws ssm get-parameter --name "/aft/config/terraform/token" --with-decryption --query "Parameter.Value" --output text)
                          TF_ENDPOINT=$(aws ssm get-parameter --name "/aft/config/terraform/api-endpoint" --query "Parameter.Value" --output text)
                          TF_PROJECT_NAME=$(aws ssm get-parameter --name "/aft/config/terraform/project-name" --query "Parameter.Value" --output text)
                          TF_WORKSPACE_NAME="ct-aft-account-provisioning-customizations"
                          TF_CONFIG_PATH="./temp_configuration_file.tar.gz"
                          cd $DEFAULT_PATH/terraform
              -           for f in *.jinja; do jinja2 $f -D timestamp="$TIMESTAMP" -D provider_region=$CT_MGMT_REGION -D tf_distribution_type=$TF_DISTRIBUTION -D terraform_org_name=$TF_ORG_NAME -D terraform_workspace_name=$TF_WORKSPACE_NAME -D aft_admin_role_arn=$AFT_EXEC_ROLE_ARN >> ./$(basename $f .jinja).tf; done
              +           if ls *.jinja >/dev/null 2>&1; then
              +             for f in *.jinja; do
              +               jinja2 "$f" -D timestamp="$TIMESTAMP" -D provider_region="$CT_MGMT_REGION" -D tf_distribution_type="$TF_DISTRIBUTION" \
              +                 -D terraform_org_name="$TF_ORG_NAME" -D terraform_workspace_name="$TF_WORKSPACE_NAME" \
              +                 -D aft_admin_role_arn="$AFT_EXEC_ROLE_ARN" >> "./$(basename "$f" .jinja).tf"
              +             done
              +           else
              +             echo "No Jinja2 templates found - skipping template processing"
              +           fi
                          for f in *.tf; do echo "\n \n"; echo $f; cat $f; done
                          cd $DEFAULT_PATH
                          tar -czf temp_configuration_file.tar.gz -C terraform --exclude .git --exclude venv .
                          python3 $DEFAULT_PATH/aws-aft-core-framework/sources/scripts/workspace_manager.py --operation "deploy" --organization_name $TF_ORG_NAME --workspace_name $TF_WORKSPACE_NAME --assume_role_arn $AFT_ADMIN_ROLE_ARN --assume_role_session_name $ROLE_SESSION_NAME --api_endpoint $TF_ENDPOINT --api_token $TF_TOKEN --terraform_version $TF_VERSION --config_file $TF_CONFIG_PATH --project_name "$TF_PROJECT_NAME"
                        fi
                
                  build:
                    commands:
                      - |
                        if [ $TF_DISTRIBUTION = "oss" ]; then
                          terraform apply -no-color --auto-approve
                        fi
                  post_build:
                    commands:
                      - echo "Post-Build"
            EOT
            # (4 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_code_repositories.aws_codebuild_project.account_request will be updated in-place
  ~ resource "aws_codebuild_project" "account_request" {
        id                     = "arn:aws:codebuild:ca-central-1:137554749751:project/ct-aft-account-request"
        name                   = "ct-aft-account-request"
        tags                   = {}
        # (10 unchanged attributes hidden)

      ~ source {
          ~ buildspec           = <<-EOT
                # Copyright Amazon.com, Inc. or its affiliates. All rights reserved.
                # SPDX-License-Identifier: Apache-2.0
                #
                version: 0.2
                
                phases:
                  pre_build:
                    commands:
                      - DEFAULT_PATH=$(pwd)
                      - TIMESTAMP=$(date '+%Y-%m-%d %H:%M:%S')
                      - AWS_MODULE_SOURCE=$(aws ssm get-parameter --name "/aft/config/aft-pipeline-code-source/repo-url" --query "Parameter.Value" --output text)
                      - AWS_MODULE_GIT_REF=$(aws ssm get-parameter --name "/aft/config/aft-pipeline-code-source/repo-git-ref" --query "Parameter.Value" --output text)
                      - TF_VERSION=$(aws ssm get-parameter --name "/aft/config/terraform/version" --query "Parameter.Value" --output text)
                      - TF_DISTRIBUTION=$(aws ssm get-parameter --name "/aft/config/terraform/distribution" --query "Parameter.Value" --output text)
                      - CT_MGMT_REGION=$(aws ssm get-parameter --name "/aft/config/ct-management-region" --query "Parameter.Value" --output text)
                      - AFT_MGMT_ACCOUNT=$(aws sts get-caller-identity --query Account --output text)
                      - AFT_EXEC_ROLE_ARN=arn:$AWS_PARTITION:iam::$AFT_MGMT_ACCOUNT:role/AWSAFTExecution
                      - AFT_ADMIN_ROLE_NAME=$(aws ssm get-parameter --name /aft/resources/iam/aft-administrator-role-name | jq --raw-output ".Parameter.Value")
                      - AFT_ADMIN_ROLE_ARN=arn:$AWS_PARTITION:iam::$AFT_MGMT_ACCOUNT:role/$AFT_ADMIN_ROLE_NAME
                      - ROLE_SESSION_NAME=$(aws ssm get-parameter --name /aft/resources/iam/aft-session-name | jq --raw-output ".Parameter.Value")
                      - |
                        ssh_key_parameter=$(aws ssm get-parameter --name /aft/config/aft-ssh-key --with-decryption 2> /dev/null || echo "None")
                        if [[ $ssh_key_parameter != "None" ]]; then
                          ssh_key=$(jq --raw-output ".Parameter.Value" <<< $ssh_key_parameter)
                          mkdir -p ~/.ssh
                          echo "Host *" >> ~/.ssh/config
                          echo "StrictHostKeyChecking no" >> ~/.ssh/config
                          echo "UserKnownHostsFile=/dev/null" >> ~/.ssh/config
                          echo "$ssh_key" > ~/.ssh/ssh_key
                          echo -e "\n\n" >>  ~/.ssh/ssh_key
                          chmod 600 ~/.ssh/ssh_key
                          eval "$(ssh-agent -s)"
                          ssh-add ~/.ssh/ssh_key
                        fi
                      - git config --global credential.helper '!aws codecommit credential-helper $@'
                      - git config --global credential.UseHttpPath true
                      - git clone -b $AWS_MODULE_GIT_REF $AWS_MODULE_SOURCE aws-aft-core-framework
                      - python3 -m venv ./venv
                      - source ./venv/bin/activate
                      - pip install jinja2-cli==0.7.0 Jinja2==3.0.1 MarkupSafe==2.0.1 boto3==1.18.56 requests==2.26.0
                      - |
                        if [ $TF_DISTRIBUTION = "oss" ]; then
                          TF_BACKEND_REGION=$(aws ssm get-parameter --name "/aft/config/oss-backend/primary-region" --query "Parameter.Value" --output text)
                          TF_KMS_KEY_ID=$(aws ssm get-parameter --name "/aft/config/oss-backend/kms-key-id" --query "Parameter.Value" --output text)
                          TF_DDB_TABLE=$(aws ssm get-parameter --name "/aft/config/oss-backend/table-id" --query "Parameter.Value" --output text)
                          TF_S3_BUCKET=$(aws ssm get-parameter --name "/aft/config/oss-backend/bucket-id" --query "Parameter.Value" --output text)
                          TF_S3_KEY=account-request/terraform.tfstate
                          cd /tmp
                          echo "Installing Terraform"
                          curl -o terraform_${TF_VERSION}_linux_amd64.zip https://releases.hashicorp.com/terraform/${TF_VERSION}/terraform_${TF_VERSION}_linux_amd64.zip
                          unzip -o terraform_${TF_VERSION}_linux_amd64.zip && mv terraform /usr/bin
                          terraform --version
                          cd $DEFAULT_PATH/terraform
              -           for f in *.jinja; do jinja2 $f -D timestamp="$TIMESTAMP" -D tf_distribution_type=$TF_DISTRIBUTION -D provider_region=$CT_MGMT_REGION -D region=$TF_BACKEND_REGION -D bucket=$TF_S3_BUCKET -D key=$TF_S3_KEY -D dynamodb_table=$TF_DDB_TABLE -D kms_key_id=$TF_KMS_KEY_ID -D aft_admin_role_arn=$AFT_EXEC_ROLE_ARN -D tf_version=$TF_VERSION >> ./$(basename $f .jinja).tf; done
              +           if ls *.jinja >/dev/null 2>&1; then
              +             for f in *.jinja; do
              +               jinja2 "$f" -D timestamp="$TIMESTAMP" -D...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.account_metadata_ssm"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.persist_metadata"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.tag_account"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_persist_metadata"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_tag_account"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_states"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
